import { LOCALES } from 'i18n/locales';

// eslint-disable-next-line import/no-anonymous-default-export
export default {
  [LOCALES.RUSSIAN]: {
    slider_title: 'Домашние кошки',

    // login/signup form
    signup: 'Регистрация',
    login: 'Вход',

    name: 'Имя',
    name_required: 'Имя обязательно',
    name_err_msg: 'Имя должно состоять не менее чем из 3 символов',

    email: 'Эл. почта',
    email_required: 'Эл. почта обязательна',
    email_err_msg: 'Эл. почта не является допустимой',

    password: 'Пароль',
    password_required: 'Пароль обязателен',
    password_visibility: 'Видимость пароля',
    password_err_msg:
      'Пароль может содержать буквы, цифры, дефисы и символы подчеркивания',
    password_short_err: 'Пароль должен состоять не менее чем из 7 символов',
    password_long_err: 'Пароль должен состоять не более чем из 18 символов',
    repeat_password: 'Повторите пароль',
    passwords_should_match: 'Пароли должны совпадать!',

    age: 'Возраст',
    age_required: 'Требуется возраст',
    age_err_msg: 'Значение должно быть больше 1',
    accept: 'Я принимаю условия Пользовательского соглашения',

    // page todos
    add: 'Добавить задачу',
    charts: 'Графики',
    chart_title: 'Завершенные и незавершенные задачи',
    confirm_delete_title: 'Вы действительно хотите удалить эту задачу?',
    confirm_delete_text:
      'Вы не сможете восстановить эту задачу, если удалите ее.',
    cancel: 'Отмена',
    delete: 'Удалить',
    date_picker_label: 'Задача по дате создания',
    languages: 'Поиск языка',
    save: 'Сохранить',
    done: 'Выполнено',
    not_done: 'Не выполнено',
    label_todo: 'Задача',
    todo_required: 'Требуется описание задачи',
    todo_short_msg: 'Описание должно содержать не менее 3 символов',
    todo_long_msg: 'Описание должно содержать не более 70 символов',
    slider: 'Слайдер',
    todos: 'Задачи',
    search: 'Поиск',
    status: 'Статус',
    all: 'Все',
    completed: 'Завершено',
    not_completed: 'Не завершено',
    sort: 'Сортировать',
    by_default: 'По умолчанию',
    alphabetical: 'По алфавиту',
    in_reverse: 'В обратном порядке',
    description: 'Описание',
    actions: 'Действия',
    welcome: 'Добро пожаловать',
    guest: 'Гость',
    logout: 'Выйти',

    // slider
    title_1slider: 'Полосатый кот',
    title_2slider: 'Черно-белый кот',
    title_3slider: 'Серый кот',
    title_4slider: 'Пушистый кот',
    title_5slider: 'Голубоглазый кот',
    title_6slider: 'Сиамская кошка',
    title_7slider: 'Животные',
    title_8slider: 'Персидский кот',
    title_9slider: 'Цветной кот',
    title_10slider: 'Желтоглазый кот',
    title_11slider: 'Рыжий кот',
    title_12slider: 'Короткошерстная кошка',
    title_13slider: 'Черная кошка',

    text_1slider: 'Кошка - домашний вид мелких хищных млекопитающих.',
    text_2slider:
      'Кошка может быть домашней кошкой, фермерской кошкой или одичавшей кошкой.',
    text_3slider:
      'Домашние кошки ценятся людьми за общение и умение охотиться на грызунов.',
    text_4slider: 'Около 60 пород кошек признаны различными реестрами кошек.',
    text_5slider:
      'Кошачье общение включает в себя такие вокализации, как мяуканье, мурлыканье, трели, шипение, рычание и хрюканье, а также язык тела, характерный для кошек',
    text_6slider:
      'Хищник, наиболее активный на рассвете и в сумерках (сумеречный), кошка - одиночный охотник, но социальный вид',
    text_7slider:
      'Он может слышать звуки, слишком слабые или слишком высокочастотные для человеческого уха, например, издаваемые мышами и другими мелкими млекопитающими',
    text_8slider:
      'Домашние кошки могут иметь котят с весны до поздней осени, размер помета часто колеблется от двух до пяти котят',
    text_9slider:
      'Домашних кошек разводят и показывают на мероприятиях как зарегистрированных породистых кошек - хобби, известное как кошачьи фантазии',
    text_10slider:
      'Контроль за популяцией кошек может осуществляться путем стерилизации и стерилизации, но их распространение и отказ от домашних животных привели к появлению большого количества одичавших кошек во всем мире',
    text_11slider:
      'Кошки были впервые одомашнены на Ближнем Востоке около 7500 г. до н.э.',
    text_12slider:
      'Долгое время считалось, что приручение кошек началось в Древнем Египте, где кошек почитали примерно с 3100 г. до н.э.',
    text_13slider:
      'По состоянию на 2021 год в мире насчитывается около 220 миллионов домашних и 480 миллионов бездомных кошек',
  },
};
