import { LOCALES } from 'i18n/locales';

// eslint-disable-next-line import/no-anonymous-default-export
export default {
  [LOCALES.UKRAINIAN]: {
    slider_title: 'Домашні кішки',

    // login/signup form
    signup: 'Реєстрація',
    login: 'Вхід',

    name: 'Ім’я',
    name_required: 'Ім’я обов’язкове',
    name_err_msg: 'Ім’я має містити не менше 3 символів',

    email: 'Електронна пошта',
    email_required: 'Потрібна електронна пошта',
    email_err_msg: 'Електронна пошта недійсна',

    password: 'Пароль',
    password_required: 'Необхідний пароль',
    password_visibility: 'Видимість пароля',
    password_err_msg:
      'Пароль може містити букви, цифри, дефіси та підкреслення',
    password_short_err: 'Пароль повинен містити не менше 7 символів',
    password_long_err: 'Пароль повинен містити не більше 18 символів',
    repeat_password: 'Повторити пароль',
    passwords_should_match: 'Паролі повинні збігатися!',

    age: 'Вік',
    age_required: 'Вік обов’язковий',
    age_err_msg: 'Значення має бути більше 1',
    accept: 'Я приймаю умови Угоди користувача',

    // page todos
    add: 'Додати завдання',
    charts: 'Діаграми',
    chart_title: 'Виконані та невиконані завдання',
    confirm_delete_title: 'Ви впевнені, що хочете видалити це завдання?',
    confirm_delete_text:
      'Ви не зможете відновити це завдання, якщо видалите його.',
    cancel: 'Скасувати',
    delete: 'Видалити',
    date_picker_label: 'Завдання по даті створення',
    languages: 'Пошук мови',
    save: 'Зберегти',
    done: 'Готово',
    not_done: 'Не зроблено',
    label_todo: 'Завдання',
    todo_required: 'Потрібен опис завдання',
    todo_short_msg: 'Опис має містити принаймні 3 символи',
    todo_long_msg: 'Опис має містити не більше 70 символів',
    slider: 'Слайдер',
    todos: 'Завдання',
    search: 'Пошук',
    status: 'Статус',
    all: 'Усі',
    completed: 'Завершено',
    not_completed: 'Не завершено',
    sort: 'Сортувати',
    by_default: 'За замовчуванням',
    alphabetical: 'За алфавітом',
    in_reverse: 'В оберненому порядку',
    description: 'Опис',
    actions: 'Дії',
    my_profile: 'Мій профіль',
    guest: 'Гість',
    logout: 'Вихід',
    close_modal: 'Закрити модальне вікно',
    clear_search: 'Очистити пошук',
    show_all_todos: 'Показати всі завдання',
    delete_task: 'Видалити завдання',
    update_task: 'Оновити завдання',
    exit: 'Вихід',
    users: 'Користувачі',
    tasks: 'Завдання',
    admin: 'Адмін',
    user: 'Юзер',
    scroll_to_top: 'Прокрутити вгору',
    update_avatar: 'Оновити аватар',
    update_name: 'Оновити назву',
    zoom: 'Збільшити',
    role: 'Роль',
    completed_user: 'Завершено',
    update_completed: 'Оновити статус',
    change_admin: 'Змінити адміністратора',
    owner: 'Власник',

    // slider
    title_1slider: 'Полосатий кіт',
    title_2slider: 'Чорно-білий кіт',
    title_3slider: 'Сірий кіт',
    title_4slider: 'Пухнастий кіт',
    title_5slider: 'Синьоокий кіт',
    title_6slider: 'Сіамська кішка',
    title_7slider: 'Тварини',
    title_8slider: 'Персидський кіт',
    title_9slider: 'Кольорова кішка',
    title_10slider: 'Жовтоокий кіт',
    title_11slider: 'Рудий кіт',
    title_12slider: 'Короткошерста кішка',
    title_13slider: 'Чорний кіт',

    text_1slider: 'Кішка - це свійський вид дрібних хижих ссавців.',
    text_2slider:
      'Кішка може бути або домашньою, або сільськогосподарською, або дикою кішкою.',
    text_3slider:
      'Домашні кішки цінуються людьми за товариство і здатність полювати на гризунів.',
    text_4slider: 'Близько 60 порід котів визнано різними реєстрами котів.',
    text_5slider:
      'Спілкування з кішкою включає голосування, таке як нявкання, муркотіння, тремтіння, шипіння, гарчання та бурчання, а також мова тіла, характерна для кішки.',
    text_6slider:
      'Хижак, який найбільш активний на світанку та в сутінках (крепускулярний), кіт - поодинокий мисливець, але соціальний вид.',
    text_7slider:
      'Він може чути занадто слабкі або занадто високі частоти для людських вух, наприклад, миші та інші дрібні ссавці.',
    text_8slider:
      'Домашні кішки-самки можуть мати кошенят з весни до пізньої осені, причому розміри посліду часто коливаються від двох до п’яти кошенят.',
    text_9slider:
      'Домашні кішки розводяться і показуються на заходах як зареєстровані породисті коти, хобі, відоме як фантазія котів.',
    text_10slider:
      'Контроль над популяцією кішок може здійснюватися шляхом стерилізації та кастрації, але їх розповсюдження та відмова від домашніх тварин призвели до великої кількості диких котів у всьому світі',
    text_11slider:
      'Коти були вперше одомашнені на Близькому Сході близько 7500 р. До н.е.',
    text_12slider:
      'Довгий час вважалося, що приручення котів почалося в Стародавньому Єгипті, де котів почитали приблизно з 3100 року до н.е.',
    text_13slider:
      'Станом на 2021 рік у світі налічується 220 мільйонів власних та 480 мільйонів бездомних котів.',
  },
};
